var dishes = [
    {
        type: 'Первые блюда',
        name: 'Борщ',
        calorie: 61.6,
        protein: 3.8,
        fat: 2.9,
        carbo: 5.4,
        img: 'img/borsch.jpg',
        component: ['Свекла', 'Морковь', 'Лук репчатый', 'Картофель', 'Свинина', 'Томатная паста', 'Масло подслолнечное']
    },
    {
        type: 'Первые блюда',
        name: 'Суп гороховый',
        calorie: 54.3,
        protein: 2.2,
        fat: 3,
        carbo: 5,
        img: '',
        component: ['Морковь', 'Лук репчатый', 'Картофель', 'Свинина', 'Горох', 'Масло подслолнечное']
    },
    {
        type: 'Первые блюда',
        name: 'Суп грибной',
        calorie: 50.9,
        protein: 0.8,
        fat: 3.4,
        carbo: 4.6,
        img: '',
        component: ['Морковь', 'Лук репчатый', 'Картофель', 'Грибы', 'Масло подслолнечное']
    },
    {
        type: 'Первые блюда',
        name: 'Суп куриный с вермишелью',
        calorie: 59.7,
        protein: 4.5,
        fat: 3.3,
        carbo: 3.1,
        img: '',
        component: ['Морковь', 'Лук репчатый', 'Картофель', 'Курица', 'Вермишель', 'Масло подслолнечное']
    },
    {
        type: 'Первые блюда',
        name: 'Рассольник',
        calorie: 40.4,
        protein: 0.9,
        fat: 1.6,
        carbo: 5.9,
        img: '',
        component: ['Морковь', 'Лук репчатый', 'Картофель', 'Курица', 'Рис', 'Огрурец соленый', 'Масло подслолнечное']
    },
    {
        type: 'Первые блюда',
        name: 'Суп молочный с вермишелью',
        calorie: 64.6,
        protein: 2.8,
        fat: 2.7,
        carbo: 7.7,
        img: '',
        component: ['Молоко', 'Вермишель', 'Сахар', 'Масло сливочное']
    },
    {
        type: 'Первые блюда',
        name: 'Суп сырный',
        calorie: 93.4,
        protein: 4.7,
        fat: 6.9,
        carbo: 3.2,
        img: '',
        component: ['Молоко', 'Сыр плавленный', 'Картофель', 'Лук', 'Масло сливочное']
    },
    {
        type: 'Первые блюда',
        name: 'Уха',
        calorie: 66.7,
        protein: 8.5,
        fat: 1.9,
        carbo: 4.3,
        img: '',
        component: ['Рыба', 'Морковь', 'Картофель', 'Лук', 'Масло сливочное']
    },
    {
        type: 'Первые блюда',
        name: 'Щи из кислой капусты',
        calorie: 37.2,
        protein: 2,
        fat: 2.8,
        carbo: 1,
        img: '',
        component: ['Капуста квашеная', 'Морковь', 'Картофель', 'Лук', 'Курица', 'Масло подслолнечное']
    },
    {
        type: 'Первые блюда',
        name: 'Суп харчо',
        calorie: 43.9,
        protein: 2.2,
        fat: 2.1,
        carbo: 4.3,
        img: '',
        component: ['Капуста квашеная', 'Морковь', 'Картофель', 'Лук', 'Курица', 'Масло подслолнечное']
    },
    {
        type: 'Вторые блюда',
        name: 'Каша гречневая',
        calorie: 98.7,
        protein: 3.6,
        fat: 2.2,
        carbo: 17.1,
        img: '',
        component: ['Крупа гречневая', 'Масло сливочное']
    },
    {
        type: 'Вторые блюда',
        name: 'Каша манная',
        calorie: 162.1,
        protein: 5.3,
        fat: 6,
        carbo: 23.2,
        img: '',
        component: ['Крупа манная', 'Масло сливочное']
    },
    {
        type: 'Вторые блюда',
        name: 'Каша ячневая',
        calorie: 48.6,
        protein: 1.8,
        fat: 1,
        carbo: 8.7,
        img: '',
        component: ['Крупа ячневая', 'Масло сливочное']
    },
    {
        type: 'Вторые блюда',
        name: 'Котлеты свинные',
        calorie: 438.2,
        protein: 29,
        fat: 35.8,
        carbo: 0.4,
        img: '',
        component: ['Свинина', 'Лук репчатый', 'Молоко', 'Мука', 'Масло подсолнечное']
    },
    {
        type: 'Вторые блюда',
        name: 'Жаркое из свинины',
        calorie: 233.2,
        protein: 10.6,
        fat: 20.8,
        carbo: 0.7,
        img: '',
        component: ['Свинина', 'Лук репчатый', 'Морковь', 'Картофель', 'Масло подсолнечное', 'Масло подсолнечное', 'Томатная паста', 'Чеснок']
    },
    {
        type: 'Вторые блюда',
        name: 'Рыба жаренная в тесте',
        calorie: 227,
        protein: 15.4,
        fat: 12.3,
        carbo: 14.7,
        img: '',
        component: ['Рыба', 'Яйца', 'Мука', 'Масло подсолнечное']
    },
    {
        type: 'Вторые блюда',
        name: 'Яичница глазунья',
        calorie: 240.8,
        protein: 15.9,
        fat: 19.3,
        carbo: 1,
        img: '',
        component: ['Яйца', 'Масло подсолнечное']
    },
    {
        type: 'Вторые блюда',
        name: 'Омлет',
        calorie: 221.8,
        protein: 12.2,
        fat: 18.4,
        carbo: 1.9,
        img: '',
        component: ['Яйца', 'Мука', 'Молоко', 'Масло подсолнечное']
    },
    {
        type: 'Вторые блюда',
        name: 'Картофель молодой в сметане',
        calorie: 161.6,
        protein: 2.1,
        fat: 14,
        carbo: 7.2,
        img: '',
        component: ['Картофель', 'Сметана', 'Укроп']
    },
    {
        type: 'Вторые блюда',
        name: 'Картофель жаренный',
        calorie: 203.3,
        protein: 3.7,
        fat: 10.6,
        carbo: 4.8,
        img: '',
        component: ['Картофель', 'Масло подсолнечное', 'Лук репчатый']
    },
    {
        type: 'Вторые блюда',
        name: 'Картофельное пюре',
        calorie: 81.7,
        protein: 2.1,
        fat: 4.6,
        carbo: 8.5,
        img: '',
        component: ['Картофель', 'Масло сливочное', 'Молоко']
    },
    {
        type: 'Салаты',
        name: 'Салат из моркови и капусты',
        calorie: 140.7,
        protein: 1.7,
        fat: 11,
        carbo: 9.2,
        img: '',
        component: ['Капуста', 'Масло подсолнечное', 'Морковь']
    },
    {
        type: 'Салаты',
        name: 'Салат из помидоров и огурцов',
        calorie: 130,
        protein: 2,
        fat: 10,
        carbo: 8.3,
        img: '',
        component: ['Огурец', 'Помидор', 'Масло подсолнечное']
    },
    {
        type: 'Салаты',
        name: 'Салат из свеклы и чернослива',
        calorie: 117.7,
        protein: 1.7,
        fat: 8.8,
        carbo: 8.5,
        img: '',
        component: ['Свекла', 'Чернослив', 'Орехи грецкие', 'Сметана']
    },
    {
        type: 'Десерты',
        name: 'Блины',
        calorie: 218,
        protein: 9.3,
        fat: 8.7,
        carbo: 27.2,
        img: '',
        component: ['Молоко', 'Мука', 'Яйца', 'Масло подсолнечное']
    },
    {
        type: 'Десерты',
        name: 'Желе из сливок',
        calorie: 218,
        protein: 9.3,
        fat: 8.7,
        carbo: 27.2,
        img: '',
        component: ['Сливки', 'Яйца', 'Сахар', 'Желатин']
    },
    {
        type: 'Десерты',
        name: 'Сырники',
        calorie: 248,
        protein: 9.6,
        fat: 14.1,
        carbo: 22.1,
        img: '',
        component: ['Творог', 'Яйца', 'Сахар', 'Мука']
    },
    {
        type: 'Напитки',
        name: 'Кисель молочный',
        calorie: 33.5,
        protein: 0.9,
        fat: 1,
        carbo: 5.5,
        img: '',
        component: ['Сахар', 'Молоко', 'Крахмал', 'Ванилин']
    },
    {
        type: 'Напитки',
        name: 'Компот из вишни',
        calorie: 53.5,
        protein: 0.3,
        fat: 0.05,
        carbo: 13.7,
        img: '',
        component: ['Сахар', 'Вишня']
    },
    {
        type: 'Напитки',
        name: 'Чай с лимоном',
        calorie: 41.4,
        protein: 0.2,
        fat: 0.05,
        carbo: 5.5,
        img: '',
        component: ['Сахар', 'Лимон', 'Чай']
    },
    {
        type: 'Напитки',
        name: 'Чай с молоком',
        calorie: 52.5,
        protein: 0.9,
        fat: 0.8,
        carbo: 10.5,
        img: '',
        component: ['Сахар', 'Молоко', 'Чай']
    }

];
